#!/bin/bash
initDir () {
    mkdir "$1/$2"
    echo    "ФИО: $3"                   >   "$1/$2/readme.txt"
    echo    "Начало занятий: $(date)"   >>  "$1/$2/readme.txt"

}

mkdir   "$1"
initDir "$1"    "Алгебра и геометрия"       "Погожев Сергей Владимирович"
initDir "$1"    "Мат. анализ"               "Платонов Алексей Викторович"
initDir "$1"    "Основы программирования"   "Погожев Сергей Владимирович"
initDir "$1"    "Дискретная математика"     "Погожев Сергей Владимирович"

cp  "./op.sh"       "$1/"
cp  "./algem.sh"    "$1/"